In [29]:
import pandas as pd
import numpy as np

In [30]:
data = {
    'first': ['John', 'Alice', 'Bob', 'Eve', 'Charlie', None, np.nan, 'Olivia', 'Sophia', 'NA'],
    'last': ['Doe', 'Smith', 'Johnson', 'Anderson', 'Brown', 'Miller', 'Wilson', 'Moore', 'Davis', 'Martinez'],
    'email': ['john.doe@example.com', 'alice.smith@example.com', 'NA', None, 'charlie.brown@example.com',
              'grace.miller@example.com', None, 'olivia.moore@example.com', np.nan, 'liam.martinez@example.com'],
    'age': [25, 30, np.nan, None, 40, 28, 45, 32, np.nan, 37],
    'dob': ['1998-03-15', '1993-11-21', '1980-05-10', '1975-09-07', 'NA', '1995-08-18', '1978-12-03', '1989-06-25', '1987-04-14', 'NA']
}

df = pd.DataFrame(data)
df

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1    Alice     Smith    alice.smith@example.com  30.0  1993-11-21
2      Bob   Johnson                         NA   NaN  1980-05-10
3      Eve  Anderson                       None   NaN  1975-09-07
4  Charlie     Brown  charlie.brown@example.com  40.0          NA
5     None    Miller   grace.miller@example.com  28.0  1995-08-18
6      NaN    Wilson                       None  45.0  1978-12-03
7   Olivia     Moore   olivia.moore@example.com  32.0  1989-06-25
8   Sophia     Davis                        NaN   NaN  1987-04-14
9       NA  Martinez  liam.martinez@example.com  37.0          NA

In [31]:
df.dropna()

     first      last                      email   age         dob
0     John       Doe       john.doe@example.com  25.0  1998-03-15
1    Alice     Smith    alice.smith@example.com  30.0  1993-11-21
4  Charlie     Brown  charlie.brown@example.com  40.0          NA
7   Olivia     Moore   olivia.moore@example.com  32.0  1989-06-25
9       NA  Martinez  liam.martinez@example.com  37.0          NA